perftests/smol-run2.log
hey -z 30s -m GET -cpus 4 -c 200 http://localhost:9000/smol-perf

Summary:
  Total:	30.0082 secs
  Slowest:	0.1225 secs
  Fastest:	0.0000 secs
  Average:	0.0128 secs
  Requests/sec:	15651.2475
  
  Total data:	17844534 bytes
  Size/request:	38 bytes

Response time histogram:
  0.000 [1]	|
  0.012 [250678]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.025 [171801]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.037 [32744]	|■■■■■
  0.049 [10424]	|■■
  0.061 [2930]	|
  0.073 [729]	|
  0.086 [212]	|
  0.098 [52]	|
  0.110 [15]	|
  0.122 [7]	|


Latency distribution:
  10% in 0.0017 secs
  25% in 0.0050 secs
  50% in 0.0117 secs
  75% in 0.0171 secs
  90% in 0.0245 secs
  95% in 0.0316 secs
  99% in 0.0475 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.1225 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0045 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0259 secs
  resp wait:	0.0126 secs, 0.0000 secs, 0.1225 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0424 secs

Status code distribution:
  [200]	469593 responses

Error distribution:
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57991->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57992->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57993->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57994->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57995->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57996->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57997->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57998->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:57999->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58000->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58001->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58002->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58003->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58004->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58005->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58006->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58007->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58008->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58009->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58010->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58011->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58012->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58013->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58014->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58015->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58016->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58017->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58018->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58019->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58020->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58021->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58022->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58023->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58024->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58025->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58026->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58027->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58028->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58029->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58030->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58031->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58032->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58033->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58034->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58035->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58036->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58037->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58038->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58039->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58040->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58041->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58042->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58043->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58044->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58045->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58046->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58047->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58048->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58049->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58050->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58051->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58052->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58053->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58054->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58055->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58056->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58057->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58058->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58059->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58060->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58061->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:58062->[::1]:9000: read: connection reset by peer